# 一
1. 网页设计包含哪三方面（网页规划、页面元素、页面交互）
2. 页面规划包含哪三方面（尺寸、栏目、布局）
3. 页面规划的尺寸为设计系统界面设计，取决于？（用户的显示设备）（所设计的界面，不要有横向的滚动条，可以有纵向的滚动条。手机端，要注意一些预设值，）
4. 自动适应占满所有宽度空间，一般用于____（后台管理）
5. 栏目设计包含______和_____两部分（确定栏目内容、确定栏目形式）
6. 栏目内容分为几部分，分别是什么？简述
顶部（顶部）网页的脸：含有特征元素，含有能与其他网站相区别的信息
正文：网页的躯干，包含网页需要显示的大部分内容
底部：网页的脚，包含网页的版权、审批、声明等信息及辅助栏目
7. 页面顶部一般都包含哪三部分（logo、导航栏、banner）
8. 确定栏目形式的宗旨为：________________________（要很好的表达出栏目的功能、以及它像展示的东西布局）

# 二
1. 浏览网页时，一般遵循___-型的视觉路线（F）
研究视觉路线的意义：
就可以把一些比较重要的栏目，和重要的元素放在视线停留时间比较长的区域，栏目的摆放是根据____其重要性_进行摆放的，最重要的部分放于___、_____、_____的范围（上部、靠左、中间）
对于一个网站最重要的是具有特征化的东西，比如：____和____和____（logo、banner、导航）放于页面比较___（靠上）的部分，其次是内容更新的部分。网站最吸引人的部分是网站不断更新、活跃的部分，放于比较_____（靠中间）的部分，相对重要的内容放在_____(左侧靠上)部分。
2. 通常在做页面设计之前，会做____（页面原型图）。
3. 简述页面原型图
只是展现了一个页面上所包含的所有元素和栏目，以及栏目的展现方式，以及摆放位置，相对而言比较简单
4. 色彩基本上可以分为___个色系
5. 简述7个色系。
6. 简述配色忌讳

# 三 
1. 简述网页设计风格
2. LOGO的细节要求：不可随意变色、拉伸、模糊、更改
3. 图片选取的细节要求：不可模糊、变形、质量低下、带背景色

# 四
1. 交互三要素：____、____、______
2. 统一指哪些方面：____、_____、____
3. 风格指哪些方面
4. 导航的统一指的是哪些方面的统一？
5. 醒目主要指的哪三方面？

# 五
1. 便利性可从几点讨论：___、____、_____、_____、______、____、____、______
2. 搜索文本框中要有_____
3. 放在____的内容一定要是最能吸引人的、最有特色的
4. 指示标是？其作用？
5. 什么是面包屑？面包屑的作用：
6. 什么是级联菜单？
7. 级联菜单的好处？

# 六
1. 好的网页的标准?
2. 合格的网页是什么，具有哪些特点？
3. ______是设计时最为用心的地方，把网页很好的连接起来，用户使用起来会更加方便.
4. 指示标和面包屑的作用：
5. 举出几个有关网页设计的网站：

